tap "anomalyco/tap"
tap "arleypadua/pkhex-cli"
tap "armmbed/formulae"
tap "beadbox/cask"
tap "d12frosted/emacs-plus"
tap "jason0x43/neovim-nightly"
tap "jhawthorn/fzy"
tap "maticzav/swift-graphql", "https://github.com/maticzav/swift-graphql.git"
tap "osx-cross/avr"
tap "thoughtbot/formulae"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Simple system information tool written in Python
brew "archey4"
# GNU Binutils for arm-none-eabi cross development
brew "arm-none-eabi-binutils"
# GNU compiler collection for arm-none-eabi
brew "arm-none-eabi-gcc"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Collection of portable C++ source libraries
brew "boost"
# Atmel AVR MCU programmer
brew "avrdude"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Memory upgrade for your coding agent
brew "beads"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Easily generate Instruments traces for your rust crate
brew "cargo-instruments"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Utilities for .cue and .toc files
brew "cuetools"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# USB programmer
brew "dfu-util"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Text processing system for reStructuredText
brew "docutils"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# ISO AAC audio encoder
brew "faac"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# Free lossless audio codec
brew "flac"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Vorbis general audio compression codec
brew "libvorbis"
# Audio codec
brew "opus"
# VP8/VP9 video codec
brew "libvpx"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Google Drive CLI Client
brew "gdrive"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Language server for the Go language
brew "gopls"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Post-modern modal text editor
brew "helix"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Spell checker and morphological analyzer
brew "hunspell"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# DNS library written in C
brew "ldns"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Postgres C API library
brew "libpq"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# LLM inference in C/C++
brew "llama.cpp"
# Lightning memory-mapped database: key-value data store
brew "lmdb"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Okta federated identity for AWS CLI
brew "okta-aws-cli"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14"
# Static type checker for Python
brew "pyright"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Multi-agent orchestration framework for autonomous AI task completion
brew "ralph-orchestrator"
# File browser
brew "ranger", args: ["HEAD"]
# RC file (dotfile) management
brew "rcm"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# SDL 1.2 compatibility layer that uses SDL 2.0 behind the scenes
brew "sdl12-compat"
# Multi-purpose tool for manipulating and analyzing WAV files
brew "shntool"
# GNU's portable shell tool
brew "shtool"
# SQLite extension providing 256-bit AES encryption
brew "sqlcipher"
# Cross-shell prompt for astronauts
brew "starship"
# Tool Command Language
brew "tcl-tk"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Convert TeXinfo files to HTML
brew "texi2html"
# Terminal multiplexer
brew "tmux", args: ["HEAD"]
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Digital clock in ncurses
brew "tty-clock"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Hybrid lossless audio compression
brew "wavpack"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Modular BSD reimplementation of NASM
brew "yasm"
# Tool for managing your YubiKey configuration
brew "ykman"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# A CLI to manipulate pokemon game save files.
brew "arleypadua/pkhex-cli/pkhex-cli"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9"
# Command-line interface for 1Password
cask "1password-cli"
# Terminal emulator
cask "contour"
# Collect, organise, edit and annotate documents
cask "devonthink"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# Archive manager for data compression and backups
cask "rar"
# Instant messaging application focusing on security
cask "signal"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed@preview"
mas "FocusList", id: 1086877679
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Theine", id: 955848755
mas "WhatsApp", id: 310633997
go "github.com/alexanderjeurissen/rabodebit2ynab"
uv "specify-cli"
