tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jason0x43/neovim-nightly"
tap "jhawthorn/fzy"
tap "thoughtbot/formulae"
# Provides session management: i.e. separate programs from terminals
brew "abduco"
# Graphical system information display for macOS
brew "archey"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Authenticate with AWS using your Okta credentials
brew "aws-okta"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line benchmark tool
brew "bench"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Easily generate Instruments traces for your rust crate
brew "cargo-instruments"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Utilities for .cue and .toc files
brew "cuetools"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern replacement for 'ls'
brew "exa"
# ISO AAC audio encoder
brew "faac"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Free lossless audio codec
brew "flac"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Generic library support script
brew "libtool"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Platform built on V8 to build network applications
brew "node"
# Command-line application launcher for the iOS Simulator
brew "ios-sim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Selection-based modal text editor
brew "kakoune"
# Network authentication protocol
brew "krb5"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# DNS library written in C
brew "ldns"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Postgres C API library
brew "libpq"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Audio codec
brew "opus"
# VP8/VP9 video codec
brew "libvpx"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Install NodeJS versions
brew "node-build", args: ["HEAD"]
# Manage multiple NodeJS versions
brew "nodenv"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Terminal multiplexer
brew "tmux", args: ["HEAD"]
# Process manager for Procfile-based applications and tmux
brew "overmind"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql"
# Object-relational database system
brew "postgresql@10"
# Object-relational database system
brew "postgresql@11"
# Object-relational database system
brew "postgresql@12", restart_service: true
# Cross-platform application and UI framework
brew "qt", link: false
# File browser
brew "ranger", args: ["HEAD"]
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# RC file (dotfile) management
brew "rcm"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Move files to macOS's Trash
brew "rmtrash"
# Rust toolchain installer
brew "rustup-init"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# Multi-purpose tool for manipulating and analyzing WAV files
brew "shntool"
# GNU's portable shell tool
brew "shtool"
# Secure Reliable Transport
brew "srt"
# Cross-shell prompt for astronauts
brew "starship"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Convert TeXinfo files to HTML
brew "texi2html"
# Open video compression format
brew "theora"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Google's open source JavaScript engine
brew "v8@3.15", link: true
# Hybrid lossless audio compression
brew "wavpack"
# Internet file retriever
brew "wget"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Modular BSD reimplementation of NASM
brew "yasm"
# Tool for managing your YubiKey configuration
brew "ykman"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# API documentation browser and code snippet manager
cask "dash"
# Collect, organize, edit and annotate documents
cask "devonthink"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
# Free and open-source image editor
cask "gimp"
# End-to-end encryption software
cask "keybase"
# Audio tagger focusing on efficiency
cask "kid3"
# GPU-based terminal emulator
cask "kitty"
# Office suite
cask "libreoffice"
cask "macsvg"
cask "neovim-nightly"
cask "pgadmin4"
cask "phantomjs"
# Screen measuring tool
cask "pixelsnap"
# Collaboration platform for API development
cask "postman"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Instant messaging application focusing on security
cask "signal"
# Collect, organize & share colors
cask "sip"
# Team communication and collaboration software
cask "slack"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
cask "steermouse"
# VPN client for secure internet access and private browsing
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
mas "1Password 7", id: 1333542190
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "NordVPN IKE", id: 1116599239
mas "Numbers", id: 409203825
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
mas "Theine", id: 955848755
mas "Xcode", id: 497799835
