Gazorby/fish-abbreviation-tips
acomagu/fish-async-prompt
franciscolourenco/done
fishpkg/fish-humanize-duration
jorgebucaran/fisher
laughedelic/brew-completions
halostatue/fish-brew
rstacruz/fish-asdf
